# RightDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..RightDirection Property
View Class See Also
---
The direction towards the right side of the screen.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ RightDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RightDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ RightDirection {
	XYZ^ get ();
}
```

# See Also
View Class
Autodesk.Revit.DB Namespace